
文本

Mike Harrington:[510] 548-1278:250:100:175
Christian Dobbins:[408] 538-2358:155:90:201
Susan Dalsass:[206] 654-6279:250:60:50
Archie McNichol:[206] 548-1348:250:100:175
Jody Savage:[206] 548-1278:15:188:150
Guy Quigley:[916] 343-6410:250:100:175
Dan Savage:[406] 298-7744:450:300:275
Nancy McNeil:[206] 548-1278:250:80:75
John Goldenrod:[916] 348-4278:250:100:175
Chet Main:[510] 548-5258:50:95:135
Tom Savage:[408] 926-3456:250:168:200
Elizabeth Stachelin:[916] 440-1763:175:75:300

-----------------------------

题目

1. 显示所有电话号码
2. 显示Dan的电话号码
3. 显示Susan的名字和电话号码
4. 显示所有以D开头的姓
5. 显示所有以一个C或E开头的名
6. 显示所有只有四个字符的名
7. 显示所有区号为916的人名
8. 显示Mike的捐款.显示每个值时都有以$开头.如$250$100$175
9. 显示姓,其后跟一个逗号和名,如Jody,Savage
10. 写一个awk的脚本,它的作用:
    - 显示Savage的全名和电话号码
    - 显示Chet的捐款
    - 显示所有头一个月捐款$250的人名. 注:区号本来是圆括号表示的.



-----------------------------

答案

1. awk -F ':' '{print $2}' 1.txt
2. awk -F ':' '/Dan/ {print $2}' 1.txt
3. awk -F ':' '/Susan/ {print $1, $2}' 1.txt
4. awk -F '[:| ]' '$2 ~ /^D/ {print $2}' 1.txt
5. awk -F '[:| ]' '$1 ~ /^[C|E]/ {print $1}' 1.txt
6. awk 'length($1) == 4 {print $1}' 1.txt
7. awk -F '[:| ]' '$3 ~ /[916]/ {print $1,$2}' 1.txt
8. awk -F ':' '/Mike/ {print "$" $3 "$" $4 "$" $5}' 1.txt
9. awk -F '[:| ]' 'BEGIN { OFS=","}{print $1,$2}' 1.txt
10. awk -F '[:| ]' '{if($2=="Savage") {print $1,$2,$3,$4} if ($1=="Chet") print $5,$6,$7 ; if ($5=="250") {print $1,$2}}' 1.txt